## 1.简介

​	Jmter是Apache组织开源的一个性能测试工具，可以对HTTP服务进行功能测试喝性能测试，也可以对数据库进行同样测试，还可以以多种形式展示测试结果。其功能主要包括四个部分：

- 生成负载：通常以多进程或多线程的方式模拟用户行为
- 模拟用户运行，通常一个脚本运行引擎，用户运行器附加在线程或进程上，根据脚本模拟用户定制行为
- 生成资源；用于生成测试过程中服务器、负载机的资源数据
- 生成报表；根据测试中获取的数据生成报表，以提供可视化的测试报告



## 2.指标参数说明

​	下面对几个重要的指标进行说明

![1555728938752](C:\Users\wenjingqing\AppData\Roaming\Typora\typora-user-images\1555728938752.png)

1. ​	进程数 

   Jmeter中的线程数相当于虚拟用户，即并发用户数，比如这里并发100个用户，就表示100个用户同时请求这个HTTP接口

2. Ramp-Up Period

   指定Jmeter要在多长时间内建立全部的线程，默认是0，比如设置为1，则Jmeter将每隔1/100s建立一个进程

3. 循环次数

   指每个线程请求多少次，勾选，则表示一直发送请求

4. Delay Thread creation until needed

   勾选该参数表示延迟创建线程，一般不勾选

5. 调度器

   常用于设置该次测试持续多长时间

   在运行测试之前，可以添加自己需要的监听器(图形结果和聚合报告)

   

   

## 3.聚合报告测试结果

## ![1555729574757](C:\Users\wenjingqing\AppData\Roaming\Typora\typora-user-images\1555729574757.png)

聚合报告中显示两行数据，具体字段含义分别如下

- Label: 每个Jmeter的元素(例如HTTP请求)都有Name属性
- Samples: 表示这次测试中一共发送了多少请求
- Median:中位数，也就是50%用户响应时间
- 90%Line:90%用户响应时间
- Error%:请求错误占总请求数量的百分比
- Throughput:吞吐量，在默认情况下表示每秒的请求数量
- KB/sec：每秒从服务器端接收到的数据量

## 4.图形结果测试报告

​	在Jmeter的图形结果测试报告中，有样本数目，最新样本，平均，偏离，吞吐量和中值这几个性能指标。它们的含义分别如下。

![1555729939110](C:\Users\wenjingqing\AppData\Roaming\Typora\typora-user-images\1555729939110.png)



- 样本数目：指在测试中共向服务器发出的请求数量。在成功的情况下，样本数目=设定的并发数目*循环次数
- 最新样本:指服务器响应最后一个请求时间
- 吞吐量:表示服务器每分钟出来的请求数量
- 平均：总的运行时间除以发送到服务器的请求数量
- 偏离:服务器响应时间变化，离散程度测量值的大小，即数据的分布
- 中指：指一半的服务器响应时间低于该值，而另一半高于该值